MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP128GM306/mcu.h
#define CM4FLTR CM4FLTR
extern volatile uint16_t CM4FLTR __attribute__((__sfr__));
__extension__ typedef struct tagCM4FLTRBITS {
  union {
    struct {
      uint16_t CFDIV:3;
      uint16_t CFLTREN:1;
      uint16_t CFSEL:3;
    };
    struct {
      uint16_t CFDIV0:1;
      uint16_t CFDIV1:1;
      uint16_t CFDIV2:1;
      uint16_t :1;
      uint16_t CFSEL0:1;
      uint16_t CFSEL1:1;
      uint16_t CFSEL2:1;
    };
  };
} CM4FLTRBITS;
extern volatile CM4FLTRBITS CM4FLTRbits __attribute__((__sfr__));

#define CM5CON CM5CON
extern volatile uint16_t CM5CON __attribute__((__sfr__));
__extension__ typedef struct tagCM5CONBITS {
  union {
    struct {
      uint16_t CCH:2;
      uint16_t :2;
      uint16_t CREF:1;
      uint16_t :1;
      uint16_t EVPOL:2;
      uint16_t COUT:1;
      uint16_t CEVT:1;
      uint16_t OPMODE:1;
      uint16_t :2;
      uint16_t CPOL:1;
      uint16_t COE:1;
      uint16_t CON:1;
    };
    struct {
      uint16_t CCH0:1;
      uint16_t CCH1:1;
      uint16_t :4;
      uint16_t EVPOL0:1;
      uint16_t EVPOL1:1;
      uint16_t :7;
      uint16_t CEN:1;
    };
  };
} CM5CONBITS;
extern volatile CM5CONBITS CM5CONbits __attribute__((__sfr__));

#define CM5MSKSRC CM5MSKSRC
extern volatile uint16_t CM5MSKSRC __attribute__((__sfr__));
__extension__ typedef struct tagCM5MSKSRCBITS {
  union {
    struct {
      uint16_t SELSRCA:4;
      uint16_t SELSRCB:4;
      uint16_t SELSRCC:4;
    };
    struct {
      uint16_t SELSRCA0:1;
      uint16_t SELSRCA1:1;
      uint16_t SELSRCA2:1;
      uint16_t SELSRCA3:1;
      uint16_t SELSRCB0:1;
      uint16_t SELSRCB1:1;
      uint16_t SELSRCB2:1;
      uint16_t SELSRCB3:1;
      uint16_t SELSRCC0:1;
      uint16_t SELSRCC1:1;
      uint16_t SELSRCC2:1;
      uint16_t SELSRCC3:1;
    };
  };
} CM5MSKSRCBITS;
extern volatile CM5MSKSRCBITS CM5MSKSRCbits __attribute__((__sfr__));

#define CM5MSKCON CM5MSKCON
extern volatile uint16_t CM5MSKCON __attribute__((__sfr__));
typedef struct tagCM5MSKCONBITS {
  uint16_t AANEN:1;
  uint16_t AAEN:1;
  uint16_t ABNEN:1;
  uint16_t ABEN:1;
  uint16_t ACNEN:1;
  uint16_t ACEN:1;
  uint16_t PAGS:1;
  uint16_t NAGS:1;
  uint16_t OANEN:1;
  uint16_t OAEN:1;
  uint16_t OBNEN:1;
  uint16_t OBEN:1;
  uint16_t OCNEN:1;
  uint16_t OCEN:1;
  uint16_t :1;
  uint16_t HLMS:1;
} CM5MSKCONBITS;
extern volatile CM5MSKCONBITS CM5MSKCONbits __attribute__((__sfr__));

#define CM5FLTR CM5FLTR
extern volatile uint16_t CM5FLTR __attribute__((__sfr__));
__extension__ typedef struct tagCM5FLTRBITS {
  union {
    struct {
      uint16_t CFDIV:3;
      uint16_t CFLTREN:1;
      uint16_t CFSEL:3;
    };
    struct {
      uint16_t CFDIV0:1;
      uint16_t CFDIV1:1;
      uint16_t CFDIV2:1;
      uint16_t :1;
      uint16_t CFSEL0:1;
      uint16_t CFSEL1:1;
      uint16_t CFSEL2:1;
    };
  };
} CM5FLTRBITS;
extern volatile CM5FLTRBITS CM5FLTRbits __attribute__((__sfr__));

#define CVR2CON CVR2CON
extern volatile uint16_t CVR2CON __attribute__((__sfr__));
typedef struct tagCVR2CONBITS {
  uint16_t CVR:4;
  uint16_t CVRSS:1;
  uint16_t CVRR0:1;
  uint16_t CVROE:1;
  uint16_t CVREN:1;
  uint16_t :2;
  uint16_t VREFSEL:1;
  uint16_t CVRR1:1;
} CVR2CONBITS;
extern volatile CVR2CONBITS CVR2CONbits __attribute__((__sfr__));

#define PTGCST PTGCST
extern volatile uint16_t PTGCST __attribute__((__sfr__));
typedef struct tagPTGCSTBITS {
  uint16_t PTGITM:2;
  uint16_t :4;
  uint16_t PTGWTO:1;
  uint16_t PTGSTRT:1;
  uint16_t PTGIVIS:1;
  uint16_t PTGSSEN:1;
  uint16_t PTGSWT:1;
  uint16_t :1;
  uint16_t PTGTOGL:1;
  uint16_t PTGSIDL:1;
  uint16_t :1;
  uint16_t PTGEN:1;
} PTGCSTBITS;
extern volatile PTGCSTBITS PTGCSTbits __attribute__((__sfr__));

#define PTGCON PTGCON
extern volatile uint16_t PTGCON __attribute__((__sfr__));
typedef struct tagPTGCONBITS {
  uint16_t PTGWDT:3;
  uint16_t :1;
  uint16_t PTGPWD:4;
  uint16_t PTGDIV:5;
  uint16_t PTGCLK:3;
} PTGCONBITS;
extern volatile PTGCONBITS PTGCONbits __attribute__((__sfr__));

#define PTGBTE PTGBTE
extern volatile uint16_t PTGBTE __attribute__((__sfr__));
__extension__ typedef struct tagPTGBTEBITS {
  union {
    struct {
      uint16_t OC1TSS:1;
      uint16_t OC2TSS:1;
      uint16_t OC3TSS:1;
      uint16_t OC4TSS:1;
      uint16_t OC1CS:1;
      uint16_t OC2CS:1;
      uint16_t OC3CS:1;
      uint16_t OC4CS:1;
      uint16_t IC1TSS:1;
      uint16_t IC2TSS:1;
      uint16_t IC3TSS:1;
      uint16_t IC4TSS:1;
      uint16_t ADCTS1:1;
      uint16_t ADCTS2:1;
      uint16_t ADCTS3:1;
      uint16_t ADCTS4:1;
    };
    struct {
      uint16_t PTGBTE:16;
    };
  };
} PTGBTEBITS;
extern volatile PTGBTEBITS PTGBTEbits __attribute__((__sfr__));

#define PTGHOLD PTGHOLD
extern volatile uint16_t PTGHOLD __attribute__((__sfr__));
#define PTGT0LIM PTGT0LIM
extern volatile uint16_t PTGT0LIM __attribute__((__sfr__));
#define PTGT1LIM PTGT1LIM
extern volatile uint16_t PTGT1LIM __attribute__((__sfr__));
#define PTGSDLIM PTGSDLIM
extern volatile uint16_t PTGSDLIM __attribute__((__sfr__));
#define PTGC0LIM PTGC0LIM
extern volatile uint16_t PTGC0LIM __attribute__((__sfr__));
#define PTGC1LIM PTGC1LIM
extern volatile uint16_t PTGC1LIM __attribute__((__sfr__));
#define PTGADJ PTGADJ
extern volatile uint16_t PTGADJ __attribute__((__sfr__));
#define PTGL0 PTGL0
extern volatile uint16_t PTGL0 __attribute__((__sfr__));
#define PTGQPTR PTGQPTR
extern volatile uint16_t PTGQPTR __attribute__((__sfr__));
typedef struct tagPTGQPTRBITS {
  uint16_t PTGQPTR:5;
} PTGQPTRBITS;
extern volatile PTGQPTRBITS PTGQPTRbits __attribute__((__sfr__));

#define PTGQUE0 PTGQUE0
extern volatile uint16_t PTGQUE0 __attribute__((__sfr__));
typedef struct tagPTGQUE0BITS {
  uint16_t STEP0:8;
  uint16_t STEP1:8;
} PTGQUE0BITS;
extern volatile PTGQUE0BITS PTGQUE0bits __attribute__((__sfr__));

#define PTGQUE1 PTGQUE1
extern volatile uint16_t PTGQUE1 __attribute__((__sfr__));
typedef struct tagPTGQUE1BITS {
  uint16_t STEP2:8;
  uint16_t STEP3:8;
} PTGQUE1BITS;
extern volatile PTGQUE1BITS PTGQUE1bits __attribute__((__sfr__));

#define PTGQUE2 PTGQUE2
extern volatile uint16_t PTGQUE2 __attribute__((__sfr__));
typedef struct tagPTGQUE2BITS {
  uint16_t STEP4:8;
  uint16_t STEP5:8;
} PTGQUE2BITS;
